src/test/resources/apiXml/JLR/GetJobDetailsByEvhc.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:men="http://www.cliffordthames.com/ebusiness/menus/">
   <soapenv:Body>
      <getJobDetailsByEvhc xmlns="http://www.cliffordthames.com/ebusiness/menus/">
         <jobDetailsByEvhcRequest>
            <dealerDetails countryCode="GB" dealerIdentificationCode="gbdummy02" languageCode="EN" manufacturer="" password="Password1234" user=""/>
            <!--Clifford Thames TEST evhc details>-->
            <evhcProviderDetails id="102" password="Hammer999"/>
            <job core="false" description="" id="174800555092" jobDifficulty="1" jobSource="MAN" service="false"/>
            <vehicleMatch>
               <!--Optional:-->
               <!--regMatch>KN62SOJ</regMatch>-->
               <vinMatch>SAJAC011087N80339</vinMatch>
            </vehicleMatch>
         </jobDetailsByEvhcRequest>
      </getJobDetailsByEvhc>
   </soapenv:Body>
</soapenv:Envelope>